strings = dict(
    # START MENU
    start_msg="Добро пожаловать в магазин наперов - Димон Батюка."
              "\nТолько тут вы можете приобрести прекрасные и уникальные "
              "напера ручной работы с маслозборниками по выгодной цене."
              "\nКаждый напер изготовляется лично мастером."
              "\nПри изготовлении используються гильзы первой и второй мировой войны",
    shop_btn="🛍 Магазин",
    my_orders="🛒 Мои заказы",
    contacts_btn="👥 Контакты",
    terms_btn="🤝 Оплата и Доставка",
    # CONTACTS
    contacts="*Наш мастер:* @Dima66627"
             "\nОбращаться к мастеру если есть желание "
             "заказать уникальную работу"
             "\n*Разработка телеграм ботов:* @keikoobro",
    # TERMS
    terms_msg="После сделаного заказа - с вами свяжеться наш оператор и "
              "проинформирует когда и где вы сможете забрать товар."
              "\nНаш магазин находится в г. Киев на ст. м. Демеевская"
              "\nТовар полностью легален, никаких скрытых схем и предоплат,"
              "приходите, смотрите и забираете"
              "\nВозможна отправка новой почтой в любой город Украины",
    # SHOP
    no_products="В магазине ещё нет товаров",
    shop_title="*Список всех товаров. Количество:* `{}`",
    product_template="*Название:* `{}`"
                     "\n*Цена:* `{}`"
                     "\n*Описание:* `{}`",
    product_template_2="*Название:* `{}`"
                       "\n*Цена:* `{}`"
                       "\n*Описание:* `{}`"
                       "\n*Статус:* `{}`",
    current_page="*Текущая страница:* `{}`",
    make_order_btn="🤙 Заказать",
    confirm_order="\n\n*Заказать данный товар?*",
    order_created="Заказ успешно создан. "
                  "\nНаш специалист свяжется с вами в телеграме в ближайшее время. "
                  "\nВы можете просмотреть свои заказы нажав на кнопку 'Мои Заказы'",
    # ORDERS
    no_orders="Ещё нет заказов",
    orders_title="*Список заказов. Количество заказов:* `{}`",
    order_template="\n\n*Дата оформления заказа:* `{}`"
                   "\n*Статус:* `{}`",
    admin_order_template="\n\n*Юзер:* {}"
                         "\n*Дата оформления заказа:* `{}`"
                         "\n*Cтатус:* `{}`"
    ,
    delete_order_btn="➖ Удалить заказ",
    blink_success_delete_order="✅ Заказ успешно удалён",
    delete_order="\nТы уверен что хочешь отменить заказ?",

    # ADMIN START MENU
    admin_start_msg="👋Добро пожаловать в админку",
    add_product_btn="➕ Добавить товар",
    products_btn="🛠 Товары в магазине",
    orders_btn="💌 Заказы",
    # ADDING PRODUCT
    add_image="Отправьте изображение товара",
    set_name="Укажите название товара",
    set_price="Укажите цену товара",
    set_description="Отправьте описание товара",
    confirm_adding="Добавить позицию в магазин?",
    add_btn="➕ Добавить",
    success_adding="_Товар успешно добавлен в магазин_\n",
    # PRODUCTS
    delete_product="➖ Удалить товар",
    confirm_delete="Уверены что хотите удалить товар?"
                   "\nДанную процедуру нельзя будет отменить."
                   "\nВсе заказы с данным товаром будут удалены "
                   "и у вас и у пользователей",
    mark_as_sold_btn="Отметить как 'Проданый'",
    mark_as_in_stock_btn="Отметить как 'В наличии'",
    delete_btn="🗑 Удалить",
    blink_success_deleted_product="✅ Продукт успешно удалён",
    confirm_product_status_to_sold="\n\nОтметить как `Проданый`?",
    confirm_product_status_to_in_stock="\n\nОтметить как `В наличии`?",
    select_order_btn="Выбрать",
    select_buyer_title="*Выберете кому был продан товар*",
    not_telegram_client_btn="Другой клиент",
    # blink_success_changed_product_status="✅ Статус продукта успешно изменён",
    confirm_sell_product="\n*Отметить данный продукт как проданый данному пользователю?*",
    blink_product_in_stock="",
    blink_product_sold="Продукт Продан!",
    set_not_tel_buyer="*Укажите имя покупателя.*"
                      "\n_Эта информация будет видна только вам_",

    # ORDERS
    change_status_btn="♻️ Изменить статус",
    change_to_sold="Отметить как 'проданый'",
    change_to_not_sold="Отметить как 'в продаже'",
    # confirm_order_status_to_sold="\n\nОтметить как 'проданый'?",
    # confirm_order_status_to_not_sold="\n\nОтметить как 'в наличии'?"
    mark_as_completed_btn="✅ Выполненый ✅",
    mark_as_completed="Ометить как выполненный заказ?"
                      "\n_Данный товар станет сразу проданным в магазине_",
    blink_success_marked_as_completed="Сделка закончена. Товар - продан.",
    short_order_template="\n\n*Юзер:* {}"
                         "\n*Дата оформления заказа:* `{}`",
    # BACK BUTTON
    back="🔙Назад",
    # NOTIFICATIONS
    new_order_notification="Новый заказ!",
    new_product_notification="",
)
